{
  "pop": {
    "description": "Phí phát sinh cho ProductOfferingSpecification có thể có nhiều hình thức khác nhau",
    "recurringCharge": "Phí định kỳ được tính nhiều lần. Phí này có thời hạn, chẳng hạn như hàng tháng, hàng quý hoặc hàng năm. Ví dụ, phí hàng tháng cho cuộc gọi đường dài. Phí định kỳ cũng có thể giới hạn thời hạn áp dụng. Ví dụ, phí định kỳ chỉ được áp dụng trong 6 tháng cho một thiết bị đắt tiền.",
    "onetimeCharge": "Phí một lần được tính một lần. Ví dụ, chi phí cho một ống nghe điện thoại di động hoặc phí cài đặt (FeeProdOfferingPrice định giá AllowedProductAction).",
    "usage": {
      "description": "Phí được tính cho việc sử dụng (ProductUsageSpec), dựa trên các sự kiện đo lường. Mô hình này phân biệt giữa sử dụng đơn giản và sử dụng trong đó phí được mô tả bằng biểu giá.",
      "simpleUsage": "Sử dụng đơn giản mô tả mức phí trong đó phí giống nhau cho tất cả các sự kiện. Ví dụ, gói cước 10 xu một phút cho cuộc gọi đường dài là một ví dụ.",
      "tariffUsage": "Sử dụng giá cước mô tả mức phí có các loại phí khác nhau cho các loại sự kiện khác nhau. Điều này có thể bao gồm các gói cước có giá khác nhau cho phút gọi buổi tối và phút gọi bất kỳ lúc nào. Cách sử dụng này tổng hợp một số cách sử dụng đơn giản."
    }
  },
  "popAlteration": {
    "description": "Tương tự như vậy, các thay đổi được thực hiện đối với các ProductOfferingPrice khác phát sinh cho một ProductOfferingSpecification có thể có nhiều hình thức khác nhau, chẳng hạn như",
    "discount": "Giảm giá là giảm giá. Có thể là một khoản phí cố định như 10 đô la hoặc một phần trăm, chẳng hạn như giảm giá 50%. Giảm giá luôn áp dụng cho và do đó liên quan đến một hoặc nhiều ProdOfferPrice khác. Vì vậy, giảm giá sẽ là giảm 10 đô la cho phí cài đặt hoặc giảm 50% cho giá theo phút.",
    "replacement": "Mức giá thay thế cho một ProductOfferingPrice khác (được tính thay cho một mức giá khác). Ví dụ, mua hai sản phẩm trong cùng một sản phẩm có thể dẫn đến mức giá giảm cho cả hai.",
    "taxation": "Số tiền thuế là mức tăng giá do một khoản thuế bắt buộc của một khu vực pháp lý được ủy quyền. Đối với ProductOfferingPrice, đây là số tiền dự kiến. Số tiền thuế thực tế sẽ được áp dụng trong ProductPrice. Xem phần dành riêng bên dưới về thuế để biết thêm chi tiết."
  },
  "completePopModel": {
    "description": "Đặt các khoản phí và thay đổi trong một ví dụ duy nhất cung cấp cái nhìn toàn diện về một ProductOfferingPrice. Một gói cước không dây đơn giản bao gồm một chiếc điện thoại 75 đô la, một khoản phí kích hoạt 50 đô la, một khoản phí hàng tháng 20 đô la được thay thế bằng 10 đô la trong 6 tháng, 10 xu một phút cho các phút bổ sung và 25 xu một phút cho cuộc gọi đường dài. Các thành phần là",
    "note1": "Một khoản phí một lần 75 đô la (OneTimeProdOfferPriceCharge)",
    "note2": "Một khoản phí 50 đô la (FeeProdOfferingPrice)",
    "note3": "Một khoản phí định kỳ 20 đô la mỗi tháng (RecurringProdOfferPriceCharge)",
    "note4": "Một khoản phí thay thế 10 đô la cho khoản phí định kỳ trong 6 tháng (ReplacementProdOfferPriceAlteration)",
    "note5": "Một mức sử dụng cước phí bao gồm 10 xu cho mỗi phút sử dụng đơn giản và 25 xu cho mỗi phút sử dụng đơn giản cho cuộc gọi đường dài (SimpleUsageProdOfferPriceCharge)",
    "discountWithAgreement": {
      "description": "Thêm vào ví dụ, giả sử Sue là nhân viên của một công ty có thỏa thuận giảm giá theo khối lượng với nhà cung cấp dịch vụ. Thỏa thuận này là miễn phí cài đặt và giảm giá 20 phần trăm cho các phút gọi nội hạt.",
      "note1": "Giá tổng hợp liên kết Giảm giá 50 đô la (DiscountProdOfferPriceAlteration) với Phí 50 đô la",
      "note2": "Giá tổng hợp liên kết Giảm giá 20 phần trăm (DiscountProdOfferPriceAlteration) với 10 xu mỗi phút Sử dụng đơn giản Ngoài ra, Thuế (TaxProdOfferPriceAlteration) có thể được áp dụng cho mỗi thành phần hoặc ProductOfferingPrice tổng hợp."
    }
  },
  "completeProductPriceRuleModel": {
    "description": "Đăng ký một năm với Phụ kiện miễn phí",
    "note1": "Nếu khách hàng đăng ký truy cập Mạng cục bộ không dây (WLAN) với mức giá thông thường, khách hàng sẽ được giảm giá khi truy cập internet DSL hoặc giảm giá khi sử dụng dịch vụ điện thoại di động",
    "note2": "ProductOfferingSpecification kết hợp dịch vụ DSL theo thứ tự với một trong nhiều loại bộ định tuyến cung cấp chức năng khác nhau. Nếu cả dịch vụ DSL và một trong hai bộ định tuyến được mua, người đăng ký (khách hàng) sẽ được giảm giá năm mươi đô la cho bộ định tuyến đã chọn (chúng tôi sẽ giữ nguyên và giả định rằng chỉ có hai loại bộ định tuyến để lựa chọn trong ví dụ này). Trong trường hợp này, phiên bản ProductOfferingSpecification, 'Mua dịch vụ DSL và bộ định tuyến, được hoàn lại 50 đô la!', có các thành phần cung cấp sản phẩm là dịch vụ DSL và một trong hai bộ định tuyến khác nhau.",
    "note3": "Ví dụ tiếp theo cho thấy một quy tắc giá cho phép giảm giá cho các sản phẩm tương tự. Giả sử rằng đối với bất kỳ phụ kiện điện thoại di động nào được mua với giá thông thường, một phụ kiện có giá bằng hoặc thấp hơn phụ kiện được mua với giá thông thường có thể được mua với mức giảm giá 50%. Trong trường hợp này, ProductOfferingPrices biểu thị giá thông thường và giá chiết khấu. Trong ví dụ này, các loại điều kiện quy tắc là 'mua' và 'giá' được sử dụng. Điều kiện 'mua' chỉ định rằng phải có hai phụ kiện. Điều kiện 'giá' chỉ định mối quan hệ giữa giá của hai phụ kiện; giá của phụ kiện được chiết khấu phải nhỏ hơn hoặc bằng giá của phụ kiện được mua với giá thông thường. Tất nhiên, mô hình chính sách không thể biểu thị tất cả các hành vi được ngụ ý trong ví dụ này; mã ứng dụng sẽ phải được viết để diễn giải một quy tắc như thế này. Ví dụ, khi khách hàng mua ví điện thoại di động (một phụ kiện), ứng dụng sẽ phải kiểm tra xem có quy tắc giá nào liên quan đến các phụ kiện tương thích hay không. Ứng dụng sẽ tìm thấy quy tắc 'mua một tặng một với giá 50%'. Khách hàng có thể được truy vấn để xem liệu có nên mua phụ kiện thứ hai hay không."
  }
}
